Repository: AsierDev/microwins-app
Catalog: lib/l10n/app_*.arb
Languages: fr

# loginTitle
source: Welcome Back
fr: Bon retour

# createAccountTitle
source: Create Account
fr: Créer un Compte

# passwordLabel
source: Password
fr: Mot de passe

# loginButton
source: Login
fr: Se connecter

# signUpButton
source: Sign Up
fr: S'inscrire

# googleLoginButton
source: Continue with Google
fr: Continuer avec Google

# guestLoginButton
source: Continue as Guest
fr: Continuer en tant qu'invité

# guestDialogTitle
source: Continue as Guest?
fr: Continuer en tant qu'invité?

# guestDialogMessage
source: Your data will only be saved on this device. Sign up later to backup your habits.
fr: Vos données seront uniquement sauvegardées sur cet appareil. Inscrivez-vous plus tard pour sauvegarder vos habitudes.

# dontHaveAccount
source: Don't have an account?
fr: Vous n'avez pas de compte ?

# alreadyHaveAccount
source: Already have an account?
fr: Vous avez déjà un compte ?

source: Forgot Password?
fr: Mot de passe oublié ?

# continueButton
source: Continue
fr: Continuer

# cancelButton
source: Cancel
fr: Annuler

# resetPasswordTitle
source: Reset Password
fr: Réinitialiser le mot de passe

source: Back to Login
fr: Retour à la connexion

# sendLinkButton
source: Send Link
fr: Envoyer le lien

# resetPasswordSuccess
source: If an account exists with this email, you will receive a password reset link.
fr: Si un compte existe avec cet e-mail, vous recevrez un lien de réinitialisation de mot de passe.

# resetPasswordPrompt
source: Enter your email address and we'll send you a link to reset your password.
fr: Entrez votre adresse e-mail et nous vous enverrons un lien pour réinitialiser votre mot de passe.

# pleaseEnterEmail
source: Please enter your email
fr: Veuillez entrer votre e-mail

source: Invalid email format
fr: Format d'e-mail invalide

# pleaseEnterPassword
source: Please enter your password
fr: Veuillez entrer votre mot de passe

source: Password too short
fr: Mot de passe trop court

# homeTab
source: Home
fr: Accueil

# habitsTab
source: Habits
fr: Habitudes

# progressTab
source: Progress
fr: Progrès

# profileTab
source: Profile
fr: Profil

# newHabitTitle
source: New Habit
fr: Nouvelle Habitude

# editHabitTitle
source: Edit Habit
fr: Modifier l'Habitude

# habitNameLabel
source: Habit Name
fr: Nom de l'habitude

# habitNameHint
source: e.g., Drink Water
fr: ex., Boire de l'eau

# pleaseEnterName
source: Please enter a name
fr: Veuillez entrer un nom

# iconLabel
source: Icon
fr: Icône

# categoryLabel
source: Category
fr: Catégorie

# durationLabel
source: Duration
fr: Durée

# saveChangesButton
source: Save Changes
fr: Enregistrer les Modifications

# createHabitButton
source: Create Habit
fr: Créer une Habitude

# categoryHealth
source: Health
fr: Santé

# categoryProductivity
source: Productivity
fr: Productivité

# categoryWellness
source: Wellness
fr: Bien-être

# categoryLearning
source: Learning
fr: Apprentissage

# categoryFitness
source: Fitness
fr: Forme physique

# habitCreatedSuccess
source: Habit created successfully!
fr: Habitude créée avec succès !

# habitUpdatedSuccess
source: Habit updated successfully!
fr: Habitude mise à jour avec succès !

# errorTitle
source: Error
fr: Erreur

source: Failed to create habit
fr: Échec de la création de l'habitude

# settingsTitle
source: Settings
fr: Paramètres

# darkModeLabel
source: Dark Mode
fr: Mode sombre

# reminderTimeLabel
source: Reminder Time
fr: Heure du rappel

# testNotificationLabel
source: Test Notification
fr: Tester la notification

# privacyPolicyLabel
source: Privacy Policy
fr: Politique de confidentialité

# deleteAccountLabel
source: Delete Account
fr: Supprimer le compte

# logoutButton
source: Logout
fr: Se déconnecter

# deleteAccountDialogTitle
source: Delete Account?
fr: Supprimer le compte ?

# deleteAccountDialogMessage
source: This will permanently delete all your data. This action cannot be undone.
fr: Cela supprimera définitivement toutes vos données. Cette action ne peut pas être annulée.

# confirmButton
source: Confirm
fr: Confirmer

# discoverTitle
source: Discover
fr: Découvrir

# discoverSubtitle
source: Discover personalized micro-habits
fr: Découvrez des micro-habitudes personnalisées

# goalPromptLabel
source: What is your goal?
fr: Quel est votre objectif ?

# goalPromptHint
source: e.g., Sleep better, Learn Spanish
fr: ex., Mieux dormir, Apprendre l'espagnol

# getSuggestionsButton
source: Get Suggestions
fr: Obtenir des Suggestions

# loadingSuggestions
source: Finding perfect habits for you...
fr: Recherche des habitudes parfaites pour vous...

# errorLoadingSuggestions
source: Failed to load suggestions. Please try again.
fr: Échec du chargement des suggestions. Veuillez réessayer.

# progressTitle
source: Your Progress
fr: Vos Progrès

# streaksTitle
source: Streaks
fr: Séries

# currentStreakLabel
source: Current Streak
fr: Série Actuelle

# bestStreakLabel
source: Best Streak
fr: Meilleure Série

# totalHabitsLabel
source: Total Habits
fr: Habitudes Totales

# activeTodayLabel
source: Active Today
fr: Actives Aujourd'hui

# onboardingTitle1
source: Build habits in just 2-5 minutes
fr: Créez des habitudes en seulement 2-5 minutes

# onboardingSubtitle1
source: Small actions lead to big results. Start with micro-habits that are easy to stick to.
fr: De petites actions mènent à de grands résultats. Commencez avec des micro-habitudes faciles à maintenir.

# onboardingTitle2
source: Track streaks, earn badges
fr: Suivez les séries, gagnez des badges

# onboardingSubtitle2
source: Stay motivated by keeping your streak alive and unlocking achievements.
fr: Restez motivé en gardant votre série vivante et en débloquant des réalisations.

# onboardingTitle3
source: AI-powered habit suggestions
fr: Suggestions d'habitudes powered by IA

# onboardingSubtitle3
source: Not sure where to start? Let AI generate personalized micro-routines for you.
fr: Vous ne savez pas par où commencer? Laissez l'IA générer des micro-routines personnalisées pour vous.

# getStartedButton
source: Get Started
fr: Commencer

# privacyPolicyTitle
source: Privacy Policy
fr: Politique de Confidentialité

# privacyPolicyContent
source: We respect your privacy. Your data is stored securely and never shared with third parties.
fr: Nous respectons votre vie privée. Vos données sont stockées en toute sécurité et ne sont jamais partagées avec des tiers.

# notificationTitle
source: Time for your habits!
fr: Il est temps pour vos habitudes !

# notificationBody
source: You have {count} habits waiting for you today.
fr: Vous avez {count} habitudes qui vous attendent aujourd'hui.

# noHabitsYet
source: No habits yet. Start small!
fr: Pas encore d'habitudes. Commencez petit!

source: Create First Habit
fr: Créer Première Habitude

# confirmDeleteTitle
source: Confirm
fr: Confirmer

# confirmDeleteMessage
source: Are you sure you want to delete this habit?
fr: Êtes-vous sûr de vouloir supprimer cette habitude?

source: Total Habits
fr: Habitudes Totales

source: Completed Today
fr: Terminées Aujourd'hui

source: Weekly Completion
fr: Complétion Hebdomadaire

source: Discover Habits
fr: Découvrir des Habitudes

source: What is your goal?
fr: Quel est votre objectif?

source: Sleep Better
fr: Mieux Dormir

source: Reduce Stress
fr: Réduire le Stress

# learnSkill
source: Learn a Skill
fr: Apprendre une Compétence

source: Stay Hydrated
fr: Rester Hydraté

# enterGoalPrompt
source: Enter a goal to generate micro-habits!
fr: Entrez un objectif pour générer des micro-habitudes!

source: Statistics
fr: Statistiques

source: Best Streak
fr: Meilleure Série

# receiveDailyReminders
source: Receive daily habit reminders
fr: Recevoir des rappels d'habitudes quotidiens

source: Use dark theme
fr: Utiliser le thème sombre

source: Optimize Notifications
fr: Optimiser les Notifications

# disableBatteryRestrictions
source: Disable battery restrictions for accurate reminders
fr: Désactiver les restrictions de batterie pour des rappels précis

source: Enable Unrestricted Battery
fr: Activer la Batterie sans Restriction

# batteryDialogMessage
source: To ensure reminders arrive on time, please disable battery restrictions for MicroWins.
fr: Pour garantir que les rappels arrivent à l'heure, veuillez désactiver les restrictions de batterie pour MicroWins.

# batteryStep1
source: 1. Tap 'Go to Settings'
fr: 1. Appuyez sur 'Aller aux Paramètres'

# batteryStep2
source: 2. Tap 'App battery usage' or 'Battery'
fr: 2. Appuyez sur 'Utilisation de la batterie de l'application' ou 'Batterie'

# batteryStep3
source: 3. Select 'Unrestricted' or 'No restrictions'
fr: 3. Sélectionnez 'Sans restriction' ou 'Aucune restriction'

source: Go to Settings
fr: Aller aux Paramètres

# gamificationBadgesAndLevels
source: Badges and Levels
fr: Badges et Niveaux

# gamificationExperience
source: Experience: {exp} EXP
fr: Expérience: {exp} EXP

# gamificationExpToNextLevel
source: {exp} EXP to next level
fr: {exp} EXP pour le niveau suivant

# gamificationStatistics
source: Statistics
fr: Statistiques

# gamificationCurrentStreak
source: Current Streak
fr: Série actuelle

# gamificationBestStreak
source: Best Streak
fr: Meilleure série

# gamificationTotalCompleted
source: Total Completed
fr: Total complété

# gamificationAchievementCollection
source: Achievement Collection
fr: Collection de succès

# gamificationUnlockedCount
source: {total}/{unlocked} unlocked
fr: {total}/{unlocked} débloqués

# gamificationLoadingAchievements
source: Loading your achievements...
fr: Chargement de vos succès...

# gamificationErrorLoadingAchievements
source: Error loading achievements
fr: Erreur lors du chargement des succès

# gamificationRetry
source: Retry
fr: Réessayer

# gamificationAchievementUnlocked
source: Achievement Unlocked!
fr: Succès débloqué !

# gamificationNewAchievementUnlocked
source: New Achievement Unlocked!
fr: Nouveau succès débloqué !

# gamificationViewAchievements
source: View Achievements
fr: Voir les succès

# gamificationActiveHabits
source: Active habits
fr: Habitudes actives

# gamificationWeeklyProgress
source: Weekly progress
fr: Progrès hebdomadaire

# gamificationMonday
source: Monday
fr: Lundi

# gamificationTuesday
source: Tuesday
fr: Mardi

# gamificationWednesday
source: Wednesday
fr: Mercredi

# gamificationThursday
source: Thursday
fr: Jeudi

# gamificationFriday
source: Friday
fr: Vendredi

# gamificationSaturday
source: Saturday
fr: Samedi

# gamificationSunday
source: Sunday
fr: Dimanche

# gamificationCompletedCount
source: {count} completed
fr: {count} complété(s)

# gamificationNoChangeFromLastWeek
source: No change from last week
fr: Pas de changement par rapport à la semaine dernière

# gamificationBetterThanLastWeek
source: {progress}% better vs same period last week
fr: {progress}% mieux vs même période semaine dernière

# gamificationWorseThanLastWeek
source: {progress}% worse vs same period last week
fr: {progress}% pire vs même période semaine dernière

# gamificationStartJourney
source: Start your journey! You have {habits} habits to complete today.
fr: Commencez votre voyage ! Vous avez {habits} habitudes à compléter aujourd'hui.

# gamificationDoingWell
source: You're doing well! Only {habits} habit{s} more to your goal.
fr: Vous vous débrouillez bien ! Plus que {habits} habitude(s) pour atteindre votre objectif.

# gamificationPerfectDay
source: Perfect! You've completed all your habits today. Keep it up!
fr: Parfait ! Vous avez complété toutes vos habitudes aujourd'hui. Continuez comme ça !

# gamificationCreateFirstHabit
source: Create your first habit to start your progress journey.
fr: Créez votre première habitude pour commencer votre progression.

# gamificationLoadingProgress
source: Loading your progress...
fr: Chargement de votre progression...

# gamificationErrorOccurred
source: An error occurred
fr: Une erreur est survenue

# gamificationBadgeTypeStreakMaster
source: Streak Master
fr: Maître des séries

# gamificationBadgeTypeConsistencyChampion
source: Consistency Champion
fr: Champion de la constance

# gamificationBadgeTypeWeeklyWarrior
source: Weekly Warrior
fr: Guerrier hebdomadaire

# gamificationBadgeTypeMilestoneMaster
source: Milestone Master
fr: Maître des jalons

# gamificationBadgeTypePerfectWeek
source: Perfect Week
fr: Semaine parfaite

# gamificationBadgeRarityCommon
source: Common
fr: Commun

# gamificationBadgeRarityUncommon
source: Uncommon
fr: Peu commun

# gamificationBadgeRarityEpic
source: Epic
fr: Épique

# gamificationBadgeRarityLegendary
source: Legendary
fr: Légendaire

# gamificationLevelTitle1
source: Beginner
fr: Débutant

# gamificationLevelTitle3
source: Apprentice
fr: Apprenti

# gamificationLevelTitle4
source: Practitioner
fr: Pratiquant

# gamificationLevelTitle5
source: Dedicated
fr: Dévoué

# gamificationLevelTitle6
source: Committed
fr: Engagé

# gamificationLevelTitle8
source: Master
fr: Maître

# gamificationLevelTitle9
source: Grand Master
fr: Grand Maître

# gamificationLevelTitle10
source: Legend
fr: Légende

# gamificationBadgeNameGettingHot
source: Getting Hot
fr: Ça chauffe

# gamificationBadgeNamePerfectWeek
source: Perfect Week
fr: Semaine Parfaite

# gamificationBadgeNameLegendMonth
source: Legend Month
fr: Mois Légendaire

# gamificationBadgeNameCentury
source: Century
fr: Siècle

# gamificationBadgeNameConsistent
source: Consistent
fr: Constant

# gamificationBadgeNameVeryConsistent
source: Very Consistent
fr: Très Constant

# gamificationBadgeNameUnbreakable
source: Unbreakable
fr: Incassable

# gamificationBadgeNameProductiveWeek
source: Productive Week
fr: Semaine Productive

# gamificationBadgeNameIntenseWeek
source: Intense Week
fr: Semaine Intense

# gamificationBadgeNameEpicWeek
source: Epic Week
fr: Semaine Épique

# gamificationBadgeNameFirstSteps
source: First Steps
fr: Premiers Pas

# gamificationBadgeNameHalfway
source: Halfway
fr: À mi-chemin

# gamificationBadgeNameHabitMaster
source: Habit Master
fr: Maître des Habitudes

# gamificationBadgeNamePerfectWeek3
source: Perfect Week (3)
fr: Semaine Parfaite (3)

# gamificationBadgeNamePerfectWeek5
source: Perfect Week (5)
fr: Semaine Parfaite (5)

# gamificationBadgeDescriptionGettingHot
source: Complete habits 3 days in a row
fr: Complétez des habitudes 3 jours de suite

# gamificationBadgeDescriptionPerfectWeek
source: Complete habits 7 days in a row
fr: Complétez des habitudes 7 jours de suite

# gamificationBadgeDescriptionLegendMonth
source: Complete habits 30 days in a row
fr: Complétez des habitudes 30 jours de suite

# gamificationBadgeDescriptionCentury
source: Complete habits 100 days in a row
fr: Complétez des habitudes 100 jours de suite

# gamificationBadgeDescriptionConsistent
source: Complete habits at least 7 days in a month
fr: Complétez des habitudes au moins 7 jours dans un mois

# gamificationBadgeDescriptionVeryConsistent
source: Complete habits at least 20 days in a month
fr: Complétez des habitudes au moins 20 jours dans un mois

# gamificationBadgeDescriptionUnbreakable
source: Complete habits every day of a month
fr: Complétez des habitudes tous les jours d'un mois

# gamificationBadgeDescriptionProductiveWeek
source: Complete 5 habits in a week
fr: Complétez 5 habitudes en une semaine

# gamificationBadgeDescriptionIntenseWeek
source: Complete 10 habits in a week
fr: Complétez 10 habitudes en une semaine

# gamificationBadgeDescriptionEpicWeek
source: Complete 20 habits in a week
fr: Complétez 20 habitudes en une semaine

# gamificationBadgeDescriptionFirstSteps
source: Complete 10 habits in total
fr: Complétez 10 habitudes au total

# gamificationBadgeDescriptionHalfway
source: Complete 50 habits in total
fr: Complétez 50 habitudes au total

# gamificationBadgeDescriptionCenturion
source: Complete 100 habits in total
fr: Complétez 100 habitudes au total

# gamificationBadgeDescriptionHabitMaster
source: Complete 500 habits in total
fr: Complétez 500 habitudes au total

# gamificationBadgeDescriptionPerfectWeek3
source: Complete all your habits during a week (3+ habits)
fr: Complétez toutes vos habitudes pendant une semaine (3+ habitudes)

# gamificationBadgeDescriptionPerfectWeek5
source: Complete all your habits during a week (5+ habits)
fr: Complétez toutes vos habitudes pendant une semaine (5+ habitudes)

# gamificationSupremeLegend
source: Supreme Legend
fr: Légende Suprême
